---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.RevisionFailures
source: html/76b78948-f425-6b6f-7a54-5fa39bd7180b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RevisionFailures

Failures about Revision Settings.

## Syntax (C#)
```csharp
public static class RevisionFailures
```